-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-12-10 10:22:00
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `casino`
--

-- --------------------------------------------------------

--
-- 資料表結構 `roulette_bets`
--

CREATE TABLE `roulette_bets` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `bet_type` enum('red','black','even','odd','big','small','exact') NOT NULL,
  `bet_number` varchar(5) DEFAULT NULL,
  `bet_amount` int(11) NOT NULL,
  `winning_number` varchar(5) DEFAULT NULL,
  `payout` int(11) DEFAULT 0,
  `bet_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `roulette_bets`
--

INSERT INTO `roulette_bets` (`id`, `username`, `bet_type`, `bet_number`, `bet_amount`, `winning_number`, `payout`, `bet_time`) VALUES
(1, '', 'black', 'black', 123, '2', 246, '2024-12-09 17:23:15'),
(2, '', 'black', 'black', 1, '26', 2, '2024-12-09 17:23:24'),
(3, '', 'big', 'big', 123, '20', 246, '2024-12-09 17:25:56'),
(4, '', 'small', 'small', 1111, '9', 2222, '2024-12-09 17:26:26'),
(5, '', 'exact', '0', 1231, '8', 0, '2024-12-09 17:26:39'),
(6, '', 'exact', '8', -134, '4', 0, '2024-12-09 17:26:50'),
(7, '', 'odd', 'odd', 123, '10', 0, '2024-12-09 17:32:30'),
(8, '', 'odd', 'odd', 123, '17', 246, '2024-12-09 17:35:19'),
(9, '', 'big', 'big', -123, '3', 0, '2024-12-09 17:42:23'),
(10, '', 'small', 'small', 123, '23', 0, '2024-12-09 17:47:32'),
(11, '', 'odd', 'odd', 1, '15', 2, '2024-12-09 17:52:31'),
(12, '', 'odd', 'odd', 1, '27', 2, '2024-12-09 17:52:42'),
(13, '', 'even', 'even', 11, '6', 22, '2024-12-09 17:52:58'),
(14, '', 'small', 'small', 12, '26', 0, '2024-12-10 06:22:34'),
(15, '', 'small', 'small', 12, '0', 0, '2024-12-10 06:22:53'),
(16, '', 'even', 'even', 12, '25', 0, '2024-12-10 06:23:10'),
(17, '', 'big', 'big', 12, '0', 0, '2024-12-10 07:04:15'),
(18, '', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:05:35'),
(19, '', 'big', 'big', 12, '0', 0, '2024-12-10 07:07:34'),
(20, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:02'),
(21, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:14'),
(22, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:20'),
(23, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:25'),
(24, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:32'),
(25, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:57:37'),
(26, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:58:42'),
(27, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:58:47'),
(28, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:58:52'),
(29, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 07:58:58'),
(30, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:28'),
(31, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:33'),
(32, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:38'),
(33, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:44'),
(34, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:50'),
(35, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:00:57'),
(36, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:03'),
(37, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:10'),
(38, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:16'),
(39, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:48'),
(40, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:53'),
(41, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:01:59'),
(42, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:02:04'),
(43, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:02:17'),
(44, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:02:22'),
(45, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:02:27'),
(46, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:02:32'),
(47, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:02:37'),
(48, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:07:32'),
(49, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:07:38'),
(50, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:07:43'),
(51, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:08:13'),
(52, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:10:12'),
(53, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:16:37'),
(54, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:16:42'),
(55, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:17:37'),
(56, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:17:42'),
(57, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:17:47'),
(58, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:17:51'),
(59, 'qweqwe', 'big', 'big', 12, '0', 0, '2024-12-10 08:19:01'),
(60, 'qweqwe', 'big', 'big', 12, '0', 0, '2024-12-10 08:19:11'),
(61, 'qweqwe', 'big', 'big', 12, '0', 0, '2024-12-10 08:19:29'),
(62, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:25:39'),
(63, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:27:16'),
(64, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:27:21'),
(65, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:28:17'),
(66, 'qweqwe', 'odd', 'odd', 12, '0', 0, '2024-12-10 08:28:25'),
(67, 'qweqwe', 'odd', '0', 12, '0', 0, '2024-12-10 08:29:36'),
(68, 'qweqwe', 'odd', '0', 12, '0', 0, '2024-12-10 08:29:43'),
(69, 'qweqwe', 'odd', '0', 12, '0', 0, '2024-12-10 08:31:48'),
(70, 'qweqwe', 'exact', '7', 12, '0', 0, '2024-12-10 08:33:18'),
(71, 'qweqwe', 'big', '0', 12, '0', 0, '2024-12-10 08:33:28'),
(72, 'qweqwe', 'odd', '0', 12, '0', 0, '2024-12-10 08:34:03'),
(73, 'qweqwe', 'big', 'big', 12, '0', 0, '2024-12-10 08:39:17'),
(74, 'qweqwe', 'big', 'big', 12, '0', 0, '2024-12-10 08:39:22'),
(75, 'qweqwe', 'odd', 'odd', 123, '6', 0, '2024-12-10 08:39:57'),
(76, 'qweqwe', 'odd', 'odd', 123, '12', 0, '2024-12-10 08:40:13'),
(77, 'qweqwe', 'odd', 'odd', 1, '0', 0, '2024-12-10 08:40:23'),
(78, 'qweqwe', 'odd', 'odd', 1, '33', 2, '2024-12-10 08:40:30'),
(79, 'qweqwe', 'black', 'black', 1, '2', 2, '2024-12-10 08:43:00'),
(80, 'qweqwe', 'black', 'black', 1, '23', 0, '2024-12-10 08:43:11'),
(81, 'qweqwe', 'black', 'black', 1, '8', 2, '2024-12-10 08:43:18'),
(82, 'qweqwe', 'even', 'even', 1, '10', 2, '2024-12-10 08:48:02'),
(83, 'qweqwe', 'even', 'even', 1, '22', 2, '2024-12-10 08:50:15'),
(84, 'qweqwe', 'odd', 'odd', 1, '3', 2, '2024-12-10 08:50:22'),
(85, 'qweqwe', 'big', 'big', 12, '2', 0, '2024-12-10 08:52:37'),
(86, 'qweqwe', 'big', 'big', 2, '35', 4, '2024-12-10 08:52:46'),
(87, 'aa', 'big', 'big', 111, '5', 0, '2024-12-10 08:57:08'),
(88, 'aa', 'big', 'big', 111, '33', 222, '2024-12-10 08:57:16'),
(89, 'aa', 'exact', '16', 11, '33', 0, '2024-12-10 08:57:39'),
(90, 'aa', 'exact', '16', 11, '19', 0, '2024-12-10 08:57:45');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `roulette_bets`
--
ALTER TABLE `roulette_bets`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `roulette_bets`
--
ALTER TABLE `roulette_bets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=91;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
